CSI API ETABS v1

# cOAPISapModel Property

---

Gets a reference to cSapModel.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cSapModel SapModel { get; }

    ReadOnly Property SapModel As cSapModel
    	Get

    Dim instance As cOAPI
    Dim value As cSapModel

    value = instance.SapModel

    property cSapModel^ SapModel {
    	cSapModel^ get ();
    }

    abstract SapModel : cSapModel with get

#### Property Value

Type: cSapModel
A reference to cSapModel

#### Return Value

Type: cSapModel
A reference to cSapModel

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cOAPI Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com